# Dockerfile

# Шаг 1: Определяем базовый образ
# Используем официальный, легковесный образ Python 3.11
FROM python:3.11-slim

# Шаг 2: Устанавливаем рабочую директорию
# Все последующие команды будут выполняться в этой папке
WORKDIR /app

# Шаг 3: Копируем файл зависимостей
# Сначала копируем только этот файл для оптимизации кэша Docker
COPY requirements.txt .

# Шаг 4: Устанавливаем зависимости
# Установка необходимых Python-пакетов
RUN pip install --no-cache-dir -r requirements.txt

# Шаг 5: Копируем код программы
# Копируем ваш скрипт Librusec_bot.py в рабочую директорию /app
COPY Librusec_bot.py .

# Шаг 6: Определяем команду для запуска
# CMD — это команда, которая будет выполняться при запуске контейнера
CMD ["python", "Librusec_bot.py"]